In [8]:
import pandas as pd 
pf= pd.read_csv('data.csv')
pf.head()

    age  distance  YearsExperience  Salary
0  31.1     77.75              1.1   39343
1  31.3     78.25              1.3   46205
2  31.5     78.75              1.5   37731
3  32.0     80.00              2.0   43525
4  32.2     80.50              2.2   39891

In [17]:
pf['age'].dtype

dtype('float64')

In [19]:
pf['distance'].dtype

dtype('float64')

In [22]:
pf['YearsExperience'].dtype

dtype('float64')

In [23]:
pf['Salary'].dtype

dtype('int64')

In [29]:
import pandas as pd 
a=pd.read_csv('mldata.csv')
a.head()

   age  weight gender likeness   height
0   27    76.0   Male  Biryani  170.688
1   41    70.0   Male  Biryani      165
2   29    80.0   Male  Biryani      171
3   27   102.0   Male  Biryani      173
4   29    67.0   Male  Biryani      164

In [32]:
import pandas as pd 
pf= pd.read_csv('mldata.csv')
pf.head()

   age  weight gender likeness   height
0   27    76.0   Male  Biryani  170.688
1   41    70.0   Male  Biryani      165
2   29    80.0   Male  Biryani      171
3   27   102.0   Male  Biryani      173
4   29    67.0   Male  Biryani      164

In [33]:
print('My name is Muhammad Abul hASSAN')

My name is Muhammad Abul hASSAN